app/views/users/show.html.erb

  <% end %>
  <% @user.visible_custom_field_values.each do |custom_value| %>
---
SELECT "custom_fields".* FROM "custom_fields" WHERE (type = 'UserCustomField') ORDER BY position