app/views/projects/settings/_repositories.html.erb

SELECT COUNT(*) FROM `repositories` WHERE `repositories`.`project_id` = 1
SELECT `repositories`.* FROM `repositories` WHERE `repositories`.`project_id` = 1
---
<% if @project.repositories.any? %>