app/views/projects/_form.html.erb


<% @project.custom_field_values.each do |value| %>
---
SELECT `custom_fields`.* FROM `custom_fields` WHERE `custom_fields`.`type` IN ('IssueCustomField') ORDER BY custom_fields.position

<fieldset class="box tabular"><legend><%= l(:label_module_plural) %></legend>
<% Redmine::AccessControl.available_project_modules.each do |m| %>
---
SELECT `projects`.* FROM `projects` WHERE (projects.status = 1)

    <label class="floating">
    <%= check_box_tag 'project[tracker_ids][]', tracker.id, @project.trackers.include?(tracker) %>
---
SELECT 1 AS one FROM "trackers" INNER JOIN "projects_trackers" ON "trackers"."id" = "projects_trackers"."tracker_id" WHERE "projects_trackers"."project_id" = 1 AND "trackers"."id" = 1 LIMIT 1
SELECT `trackers`.* FROM `trackers` ORDER BY trackers.position ASC