app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` WHERE `documents`.`project_id` = 1
---
  def index
    @sort_by = %w(category date title author).include?(params[:sort_by]) ? params[:sort_by] : 'category'
    documents = @project.documents.find :all, :include => [:attachments, :category]