app/controllers/files_controller.rb

  def index
    sort_init 'filename', 'asc'
    sort_update 'filename' => "#{Attachment.table_name}.filename",
                'created_on' => "#{Attachment.table_name}.created_on",
                'size' => "#{Attachment.table_name}.filesize",
                'downloads' => "#{Attachment.table_name}.downloads"

    @containers = [ Project.find(@project.id, :include => :attachments, :order => sort_clause)]
---
SELECT DISTINCT "projects".id, attachments.filename AS alias_0 FROM "projects" LEFT OUTER JOIN "attachments" ON "attachments"."container_id" = "projects"."id" AND "attachments"."container_type" = 'Project' WHERE "projects"."id" = $1 ORDER BY attachments.filename DESC LIMIT 1  [["id", 1]]