app/controllers/issues_controller.rb

SELECT "projects".* FROM "projects" WHERE (((projects.status <> 9) AND (projects.is_public = 't')))
SELECT DISTINCT trackers.* FROM `trackers` INNER JOIN `projects_trackers` ON `projects_trackers`.`tracker_id` = `trackers`.`id` INNER JOIN `projects` ON `projects`.`id` = `projects_trackers`.`project_id` WHERE (projects.lft >= 1 AND projects.rgt <= 2 AND projects.status <> 9) ORDER BY trackers.position
---
  def find_issue
    # Issue.visible.find(...) can not be used to redirect user to the login form
    # if the issue actually exists but requires authentication
    @issue = Issue.find(params[:id], :include => [:project, :tracker, :status, :author, :priority, :category])