app/controllers/repositories_controller.rb

INSERT INTO `repositories` (`extra_info`, `identifier`, `is_default`, `log_encoding`, `login`, `password`, `path_encoding`, `project_id`, `root_url`, `type`, `url`) VALUES (NULL, 'jlems', 1, NULL, '', '', NULL, 1, '', 'Repository::Git', 'https://github.com/LEMS/jLEMS.git')
UPDATE `repositories` SET is_default = 0 WHERE (project_id = 1)
---
  def create
    attrs = pickup_extra_info
    @repository = Repository.factory(params[:repository_scm])
    @repository.safe_attributes = params[:repository]
    if attrs[:attrs_extra].keys.any?
      @repository.merge_extra_info(attrs[:attrs_extra])
    end
    @repository.project = @project
    if request.post? && @repository.save

DELETE FROM `repositories` WHERE `repositories`.`type` IN ('Repository::Git') AND `repositories`.`id` = 1
---
  def destroy
    @repository.destroy if request.delete?

SELECT `settings`.* FROM `settings` WHERE `settings`.`name` = 'autofetch_changesets' LIMIT 1
---
  def show
    @repository.fetch_changesets if Setting.autofetch_changesets? && @path.empty?

    @entries = @repository.entries(@path, @rev)
    @changeset = @repository.find_changeset_by_name(@rev)

SELECT `repositories`.* FROM `repositories` WHERE `repositories`.`id` = 1 LIMIT 1
---
  def find_repository
    @repository = Repository.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT 1 AS one FROM `repositories` WHERE (`repositories`.`identifier` = BINARY 'jlems' AND `repositories`.`project_id` = 1) LIMIT 1
SELECT `repositories`.* FROM `repositories` WHERE `repositories`.`project_id` = 1 AND (is_default = 1) LIMIT 1
---
  def find_project_repository
    @project = Project.find(params[:id])
    if params[:repository_id].present?
      @repository = @project.repositories.find_by_identifier_param(params[:repository_id])
    else
      @repository = @project.repository
    end
    (render_404; return false) unless @repository
    @path = params[:path].is_a?(Array) ? params[:path].join('/') : params[:path].to_s
    @rev = params[:rev].blank? ? @repository.default_branch : params[:rev].to_s.strip