app/controllers/welcome_controller.rb

  def index
    @news = News.latest User.current
---
SELECT "users".* FROM "users" WHERE "users"."type" IN ('User', 'AnonymousUser') AND "users"."id" = $1 AND (users.status = 1) LIMIT 1  [["id", 1]]