app/controllers/wiki_controller.rb

  def find_existing_or_new_page
    @page = @wiki.find_or_new_page(params[:id])
---
SELECT COUNT(*) FROM `wiki_pages` WHERE `wiki_pages`.`wiki_id` = 1
SELECT `wiki_pages`.* FROM `wiki_pages` WHERE `wiki_pages`.`wiki_id` = 1 AND (LOWER(title) = LOWER('Wiki')) ORDER BY title LIMIT 1

  def load_pages_for_index
    @pages = @wiki.pages.with_updated_on.all(:order => 'title', :include => {:wiki => :project})
---
SELECT `wikis`.* FROM `wikis` WHERE `wikis`.`project_id` = 1 LIMIT 1